import 'package:bmi_calculator/component/allcolor.dart';
import 'package:bmi_calculator/component/allsize.dart';
import 'package:bmi_calculator/component/widget/cuistome_container.dart';
import 'package:flutter/material.dart';

class Beli5tipsScreens extends StatelessWidget {
  const Beli5tipsScreens({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Allcolor.redcolor,
        centerTitle: true,
        title: Text(
          "পেট সুস্থ রাখার পাঁচটি ঘরোয়া উপায়",
          style: TextStyle(
            fontSize: 21,
            color: Allcolor.blackcolor,
            fontWeight: FontWeight.bold,
          ),
        ),
      ),
      body: Padding(
        padding: const EdgeInsets.only(left: 15.0, right: 2, top: 8),
        child: SingleChildScrollView(
          child: Column(
            children: [
              SelectableText(
                "পেট সুস্থ রাখার পাঁচটি ঘরোয়া উপায় । ",
                style: TextStyle(
                  color: Allcolor.pinkcolor,
                  fontWeight: FontWeight.bold,
                  fontSize: 23,
                ),
              ),
              SizedBox(height: 5),
              SelectableText(
                "দৈনন্দিন জীবনে পাঁচটি সহজ পরিবর্তন আনার মাধ্যমে পেটকে সুস্থ রাখুন--",
                style: TextStyle(
                  fontSize: 20,
                  color: Allcolor.light_gray,
                  fontWeight: FontWeight.bold,
                ),
              ),
              SizedBox(height: 12),
              SelectableText(
                '''হজমের সমস্যা, পেট খারাপ হওয়া কিংবা পেটের অস্বস্তি—প্রায় সবাই জীবনে কখনো না কখনো এই ধরনের সমস্যার সম্মুখীন হয়ে থাকেন। কেউ কেউ আবার প্রায়ই পেটের বিভিন্ন সমস্যায় কষ্ট পান।

জীবনধারায় কিছু পরিবর্তন এনে এসব সমস্যা প্রতিরোধ করা যায়। এমনকি এভাবে পূর্ণ নিরাময় এবং পেটের সমস্যা থেকে চিরতরে মুক্তি পাওয়া সম্ভব। এই আর্টিকেলে এমন পাঁচটি সহজ পরিবর্তন আনার উপায় তুলে ধরা হয়েছে।''',
                style: TextStyle(fontSize: 18),
              ),
          
              SizedBox(height: 10),
              Padding(
                padding: const EdgeInsets.only(right: 12.0),
                child: Container(
                  height: 230,
                  width: double.infinity,
                  decoration: BoxDecoration(
                    borderRadius: BorderRadius.circular(20),
                    color: Allcolor.light_gray.withOpacity(0.4),
                  ),
                  child: Center(
                    child: SelectableText(
                      '''পরিচ্ছেদসমূহ--

১ মানসিক চাপকে হার মানাতে হবে
২ বুক জ্বালাপোড়া ও গ্যাস্ট্রিক ঠেকাতে ধূমপান ছাড়তে হবে
৩ নিয়মমতো খাওয়াদাওয়া করতে হবে
৪ অতিরিক্ত ওজন ও পেটের মেদ কমিয়ে ফেলতে হবে
৫ মদপান থেকে বিরত থাকতে হবে''',
                      style: TextStyle(
                        fontSize: 20,
                        color: Allcolor.blackcolor,
                        fontWeight: FontWeight.w500,
                      ),
                    ),
                  ),
                ),
              ),
              SizedBox(height: 20,),
              CuistomeContainer(text: "১ মানসিক চাপকে হার মানাতে হবে -- --",),
              SizedBox(height: 10,),
              SelectableText('''অনেকে হয়তো খেয়াল করে থাকবেন যে স্ট্রেস বা মানসিক চাপে থাকা অবস্থায় পেটে অস্বস্তি হয়। এর কারণ হলো, স্ট্রেস, উদ্বেগ ও দুশ্চিন্তার মতো মানসিক অবস্থা হজমের প্রক্রিয়ায় ব্যাঘাত ঘটায়।

মানসিক চাপ হজমের প্রক্রিয়ার ওপর বিভিন্ন ধরনের প্রভাব ফেলতে পারে। যেমন, কারও কারও ক্ষেত্রে খাবার পরিপাকের গতি কমে যায়। ফলে নিচের লক্ষণগুলো দেখা যায়—

পেট ফাঁপা
পেট ব্যথা
কোষ্ঠকাঠিন্য
অন্যদের ক্ষেত্রে খাবার পরিপাকের গতি বেড়ে যায়। ফলে পাতলা পায়খানা হয় এবং বারবার টয়লেটে যাওয়ার প্রয়োজন হয়। আবার কারও কারও ক্ষেত্রে খাওয়ার রুচি একেবারেই কমে যায়।

মানসিক চাপের কারণে পরিপাকতন্ত্রের কিছু রোগ বেড়ে যেতে পারে। যেমন: পাকস্থলীর আলসার ও ইরিটেবল বাওয়েল সিন্ড্রোম।

সমাধান

অতিরিক্ত মানসিক চাপে কিংবা দুশ্চিন্তায় থাকলে অথবা মন খারাপ থাকলে সেই সময়ে খাওয়াদাওয়া করা থেকে বিরত থাকুন।

খাবার টেবিলে বেশি কথা বললে পেটে অতিরিক্ত বাতাস ঢুকে পেট ফাঁপার সম্ভাবনা থাকে। আবার অনেক সময় খাবার টেবিলে কোনো কারণে তর্ক বা ঝগড়া হলে খাওয়ার ইচ্ছা চলে যেতে পারে। এসব কারণে খাবার হজমে সমস্যা হতে পারে।


তাই খাওয়ার সময়ে কথা না বলাই ভালো। খাবারের সময়টি নিশ্চিন্ত ও আনন্দময় রাখার চেষ্টা করুন।

মানসিক চাপ কমানোর ১০টি সহজ উপায় জানতে “” আর্টিকেলটি পড়তে পারেন।''',style: TextStyle(
                fontSize: Allsize.textsize
              ),),
              SizedBox(height: 10,),
              CuistomeContainer(text: "২ বুক জ্বালাপোড়া ও গ্যাস্ট্রিক ঠেকাতে ধূমপান ছাড়তে হবে-- --",),
              SizedBox(height: 10),
              SelectableText(''' বুক জ্বালাপোড়ার সমস্যাকে ‘অ্যাসিড রিফ্লাক্স’ বা ‘হার্টবার্ন’ বলা হয়। অনেকেই এটিকে গ্যাস্ট্রিক, গ্যাস্ট্রিকের ব্যথা বা অ্যাসিডিটি হিসেবে চেনেন।

ধূমপান করলে মানুষের খাদ্যনালীর নিচের অংশের পেশী দুর্বল হয়ে যায়। ফলে পাকস্থলীর অ্যাসিড উল্টো পথে খাদ্যনালী দিয়ে ওপরের দিকে উঠে আসতে পারে। একারণে অ্যাসিডিটি বা গ্যাস্ট্রিকের সমস্যা দেখা দেয়। ফলে নিচের লক্ষণগুলো দেখা দিতে পারে—

বুক জ্বালাপোড়া। সাধারণত খাওয়ার পরে এমন হয়ে থাকে
বুকে ব্যথা
পেট ফাঁপা ভাব
গলায় টক বা ঝাঁঝালো স্বাদের খাবার বা তরল উপরে উঠে আসা
এ ছাড়া গ্যাস্ট্রিকের সমস্যা থেকে পাকস্থলীর আলসার ও পরিপাক নালীর (অন্ত্রের) বিভিন্ন অংশে প্রদাহ বা জ্বালাপোড়া হতে পারে। আগে থেকেই এসব সমস্যা থাকলে অবস্থা আরও গুরুতর রূপ ধারণ করতে পারে।

ধূমপানের কারণে পেটের এসব সমস্যার পাশাপাশি পাকস্থলীর ক্যান্সার হওয়ার ঝুঁকিও বেড়ে যায়।

সমাধান---

পেট সুস্থ রাখতে এবং বিভিন্ন জটিল রোগ থেকে বাঁচতে ধূমপান ছেড়ে দিতে হবে।''',style: TextStyle(fontSize: Allsize.textsize),),
              
              SizedBox(height: 10),
              CuistomeContainer(text: "৩ নিয়মমতো খাওয়া দাওয়া করতে হবে-- --"),
              SizedBox(height: 10,),
              SelectableText('''দৈনন্দিন জীবনে নানান ধরনের ব্যস্ততা থাকে। ব্যস্ততার ফাঁকে কোনোমতে কিছু একটা খেয়ে নেওয়া, মিটিং এর ফাঁকে তাড়াহুড়ো করে খাওয়া কিংবা টিভির সামনে খাবার নিয়ে বসে পড়া বর্তমানে আমাদের দৈনন্দিন জীবনের স্বাভাবিক অংশ হয়ে দাঁড়িয়েছে। এই ধরনের খাদ্যাভ্যাস পরিপাকতন্ত্রের ক্ষতিকর প্রভাব রাখতে পারে।

সমাধান-- --

পরিপাকতন্ত্রকে সুরক্ষিত রাখতে নিচের নিয়মগুলো মেনে চলতে হবে—

খাবার খাওয়ার সময়ে তাড়াহুড়ো করবেন না। ধীরে-সুস্থে, সময় নিয়ে খাবার খেতে হবে। প্রতিবার খাবার মুখে দেওয়ার পরে হাত অথবা চামচ নামিয়ে প্লেটে রাখুন। মুখের খাবার ভালোমতো চিবিয়ে খান।
ওভারইটিং বা অতিভোজন করবেন না। তিন বেলা খাবার খাওয়ার সময়ে কতটুকু খাবার খাচ্ছেন সেই বিষয়ে খেয়াল রাখুন। এক বসায় যতটুকু খাবার খান সেই পরিমাণটি কমিয়ে আনার চেষ্টা করুন। অথবা তিন বেলা খাওয়ার বদলে সারাদিনে ছোটো ছোটো চার-পাঁচ ভাগে খাবার খেতে পারেন।
সময়মতো খাবার খেতে হবে। কোনো বেলার খাবার যেন বাদ না পড়ে সেদিকে নজর দিন।
রাতে শোয়ার আগে ভারী অথবা অতিরিক্ত খাবার খাওয়া থেকে বিরত থাকুন। ঘুমাতে যাওয়ার কমপক্ষে দুই-তিন ঘন্টা আগে রাতের খাবার সেরে ফেলুন।
পর্যাপ্ত পরিমাণে পানি পান করুন। সাধারণত একজন সুস্থ, পূর্ণবয়স্ক মানুষের দৈনিক ছয় থেকে আট গ্লাস পানি পান করা উচিত।''',style: TextStyle(fontSize: Allsize.textsize),),

        SizedBox(height: 10),
              CuistomeContainer(text: "৪ অতিরিক্ত ওজন ও পেটের মেদ কমিয়ে ফেলতে হবে",),
              SizedBox(height: 10,),
              SelectableText('''ওজন স্বাভাবিকের চেয়ে বেশি হলে পেটে জমা হওয়া মেদ-চর্বি পাকস্থলীর ওপর চাপ সৃষ্টি করে। ফলে বুক জ্বালাপোড়া করে।

সমাধান

ওজন কয়েক কেজি কমিয়ে স্বাভাবিক সীমায় নিয়ে আসার মাধ্যমে এমন হজম সংক্রান্ত সমস্যার (যেমন: বুক জ্বালাপোড়া করা অথবা পেট ফাঁপা লাগার) সমাধান করা সম্ভব।

বিএমআই ক্যালকুলেটর এর মাধ্যমে উচ্চতা অনুযায়ী সঠিক ওজন কত সেটি জেনে নিন।''',style: TextStyle(fontSize: Allsize.textsize),),
              SizedBox(height: 10),
              CuistomeContainer(text: "৫ মদপান থেকে বিরত থাকতে হবে-- --"),
              SizedBox(height: 10),
              Padding(
                padding: const EdgeInsets.only(bottom: 25.0),
                child: SelectableText('''অতিরিক্ত মদপান বা একটানা মদপান করলে পাকস্থলীতে এসিড উৎপাদনের পরিমাণ বেড়ে যায়। ফলে বুক জ্বালাপোড়া ও হজম সংক্রান্ত অন্যান্য সমস্যা বেড়ে যেতে পারে।

সমাধান

মদপান করা কমিয়ে ফেলুন, সম্ভব হলে একেবারে ছেড়ে দিন। কখনও একটানা মদপান করবেন না।''',style: TextStyle(fontSize: Allsize.textsize),),
              ),


              
          
              
            ],
          ),
        ),
      ),
    );
  }
}
